
#Область ПрограммныйИнтерфейс

// Отправить сообщение телеграм-Боту
// Параметры:
// ТекстСообщения - строка 
Процедура ОтправитьСообщениеТелеграмБоту(ТекстСообщения) Экспорт

	HTTPСоединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL());
	HTTPЗапрос= Новый HTTPЗапрос(СтрШаблон("bot%1/sendMessage", Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить()));
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("content-type", "application/json");
	HTTPЗапрос.Заголовки = Заголовки;
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("chat_id", Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить());  
	СтруктураЗапроса.Вставить("text", ТекстСообщения);
	HTTPЗапрос.УстановитьТелоИзСтроки(СтруктураЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);  
	Ответ = HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	ОтветКодСостояния = Ответ.КодСостояния;
	ОтвеnСтрока = Ответ.ПолучитьТелоКакСтроку();  
	Если ОтветКодСостояния = 200 Тогда  
		СообщениеТекст = СтрШаблон("Запрос выполнен успешно: %1", ОтвеnСтрока);  
	Иначе  
		СообщениеТекст = СтрШаблон("Ошибка: %1 - %2", ОтветКодСостояния, ОтвеnСтрока);  
		СтруктураСобытий = Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий");
		СтруктураСобытий.ИмяСобытия = ОтвеnСтрока;
		СтруктураСобытий.ПредставлениеУровня = "Ошибка";
		СтруктураСобытий.Комментарий = "";
		СобытияДляЖурналаРегистрации = Новый СписокЗначений();
		СобытияДляЖурналаРегистрации.Добавить(СтруктураСобытий);		
		ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);
	КонецЕсли;  
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СообщениеТекст;
	Сообщение.Сообщить();

КонецПроцедуры

// Обработка элементов справочника уведомления
Процедура ОбработкаЭлементовСправочникаУведомления() Экспорт

 	Выборка = Справочники.ВКМ_УведомленияТелеграмБотуДляОтправки.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОтправитьСообщениеТелеграмБоту(Выборка.Текст)
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
