
#Область ПрограммныйИнтерфейс

// ВывестиПриветствие
Процедура ВывестиПриветствие() Экспорт

//	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL());
//	Запрос = Новый HTTPЗапрос("bot8202345277:AAGRXnXrX_fD9Jy8mmhU6NsmdwZtFR63bYg/sendMessage");
//	Заголовки = Новый Соответствие;
//	Заголовки.Вставить("content-type", "application/json");
//	Данные = Новый Структура;  
//	Данные.Вставить("chat_id", "-1004802291442");  
//	Данные.Вставить("text", "ответсервиса");
//	ЧтениеJSON = Новый ЧтениеJSON;
//	ЧтениеJSON.УстановитьСтроку(Данные);
//	Запрос.УстановитьМетод("POST");
//	Запрос.УстановитьТело(ЧтениеJSON);
//	Ответ = Соединение.Отправить(Запрос);
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "222"; //Ответ.КодСостояния;
	Сообщение.Сообщить();
//Попытка Ответ = Соединение.Отправить(Запрос).
//Если Ответ.КодСостояния <> 200 — ошибка = «Ошибка: « + Ответ.КодСостояния + « - « + Ответ.ПолучитьТелоКакСтроку().
//Исключение Когда ИсходнаяОшибка — Сообщить("Произошла ошибка при выполнении запроса: " + ИсходнаяОшибка.Message).

КонецПроцедуры

#КонецОбласти
