
#Область ПрограммныйИнтерфейс

// ВывестиПриветствие
Процедура ПолучитьНаВходТекстСообщения() Экспорт

	HTTPСоединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL());
	HTTPЗапрос= Новый HTTPЗапрос("bot8202345277:AAGRXnXrX_fD9Jy8mmhU6NsmdwZtFR63bYg/sendMessage");
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("content-type", "application/json");
	HTTPЗапрос.Заголовки = Заголовки;
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("chat_id", "-1004802291442");  
	СтруктураЗапроса.Вставить("text", "Test API-Telegramm");
	HTTPЗапрос.УстановитьТелоИзСтроки(СтруктураЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);  
	Ответ = HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);  
	Если Ответ.КодСостояния = 200 Тогда  
		СообщениеТекст = СтрШаблон("Запрос выполнен успешно: %1", Ответ.ПолучитьТелоКакСтроку());  
	Иначе  
		СообщениеТекст = СтрШаблон("Ошибка: %1 - %2", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());  
		СтруктураСобытий = Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий");
		СтруктураСобытий.ИмяСобытия = Ответ.ПолучитьТелоКакСтроку();
		СтруктураСобытий.ПредставлениеУровня = "Ошибка";
		СтруктураСобытий.Комментарий = "";
		СобытияДляЖурналаРегистрации = Новый СписокЗначений();
		СобытияДляЖурналаРегистрации.Добавить(СтруктураСобытий);		
		ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);
	КонецЕсли;  
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СообщениеТекст;
	Сообщение.Сообщить();

КонецПроцедуры

#КонецОбласти
