#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
 
 	Запрос = Новый Запрос(
	  "ВЫБРАТЬ
	  |	ДоговорыКонтрагентов.ВидДоговора,
	  |	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора,
	  |	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора,
	  |	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботыСпециалиста
	  |ИЗ
	  |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	  |ГДЕ
	  |	ДоговорыКонтрагентов.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Договор); 
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();

	СообщениеТекст = "";
	Если Выборка.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		Если Дата < Выборка.ВКМ_ДатаНачалаДействияДоговора Тогда
			СообщениеТекст = "Дата документа ранее даты начала действия договора";
		ИначеЕсли Дата > Выборка.ВКМ_ДатаОкончанияДействияДоговора Тогда
			СообщениеТекст = "Дата документа позже даты окончания действия договора";
		КонецЕсли;
	Иначе
		СообщениеТекст = "Вид договора не абоненское обслуживание";
	КонецЕсли;
	Если Не ПустаяСтрока(СообщениеТекст) Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СообщениеТекст;
		Сообщение.Сообщить();
		Отказ = Истина;
	Иначе
		КоличествоЧасовДробь = (ВремяОкончанияРабот - ВремяНачалаРабот) / 3600;
		КоличествоЧасов = Цел(КоличествоЧасовДробь);
		Если КоличествоЧасов < Цел(КоличествоЧасовДробь) Тогда
			КоличествоЧасов = КоличествоЧасов + 1;
		КонецЕсли;
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = КоличествоЧасов;
		Движение.СуммаКОплате = КоличествоЧасов * Выборка.ВКМ_СтоимостьЧасаРаботыСпециалиста;	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
