
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

Функция ВыполнитьАвтозаполнение() Экспорт 
	
 	СообщениеТекст = "";
 	Запрос = Новый Запрос(
	  "ВЫБРАТЬ
	  |	ДоговорыКонтрагентов.ВКМ_СуммаЕжемесячнойАбоненсткойПлаты
	  |ИЗ
	  |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	  |ГДЕ
	  |	ДоговорыКонтрагентов.Ссылка = &Ссылка
	  |	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора");
	Запрос.УстановитьПараметр("Ссылка", Договор); 
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание); 
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
		Если ЗначениеЗаполнено(НоменклатураАбонентскаяПлата) Тогда
			НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
			Если Не ЗначениеЗаполнено(НоменклатураРаботыСпециалиста) Тогда
		 		СообщениеТекст = "РаботыСпециалис";
			КонецЕсли;		
		Иначе
	 		СообщениеТекст = "АбонентскаяПла";
		КонецЕсли;
		Если Не ПустаяСтрока(СообщениеТекст) Тогда
			СообщениеТекст = СтрШаблон("Значение константы Номенклатура%1та не заполнено", СообщениеТекст);
		КонецЕсли;
	Иначе
	 	СообщениеТекст = "Не договор абонентского обслуживаниния";
	КонецЕсли;

	ДобавленыНовыеСтроки = Ложь;
	Если ПустаяСтрока(СообщениеТекст) Тогда
 		ДокументОбъект = Ссылка.ПолучитьОбъект();
		ДокументОбъект.Товары.Очистить();
 		ДокументОбъектУслуги = ДокументОбъект.Услуги; 
		ДокументОбъектУслуги.Очистить();
		ДокументОбъект.Записать();		
		СуммаЕжемесячнойАбоненсткойПлаты = Выборка.ВКМ_СуммаЕжемесячнойАбоненсткойПлаты;
		Если СуммаЕжемесячнойАбоненсткойПлаты > 0 Тогда
			НоваяСтрока = ДокументОбъектУслуги.Добавить(); 
			НоваяСтрока.Номенклатура = НоменклатураАбонентскаяПлата; 
			НоваяСтрока.Количество = 1;    
			НоваяСтрока.Цена = СуммаЕжемесячнойАбоненсткойПлаты;    
			НоваяСтрока.Сумма = СуммаЕжемесячнойАбоненсткойПлаты;    
			ДокументОбъект.Записать();		
			ДобавленыНовыеСтроки = Истина;
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот,
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачДата, &КонДата, Месяц, Договор = &Договор) КАК
		|		ВКМ_ВыполненныеКлиентуРаботыОбороты";
		Запрос.УстановитьПараметр("НачДата", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("КонДата", КонецМесяца(Дата));
		Запрос.УстановитьПараметр("Договор", Договор);
		Выборка = Запрос.Выполнить().Выбрать();
    	Если Выборка.Следующий() Тогда
			КоличествоЧасовОборот = Выборка.КоличествоЧасовОборот;
			Если КоличествоЧасовОборот > 0 Тогда
				СуммаКОплатеОборот = Выборка.СуммаКОплатеОборот;
				Если СуммаКОплатеОборот > 0 Тогда
					НоваяСтрока = ДокументОбъектУслуги.Добавить(); 
					НоваяСтрока.Номенклатура = НоменклатураРаботыСпециалиста; 
					НоваяСтрока.Количество = КоличествоЧасовОборот;    
					НоваяСтрока.Цена = СуммаКОплатеОборот / КоличествоЧасовОборот;    
					НоваяСтрока.Сумма = СуммаКОплатеОборот;    
					ДокументОбъект.Записать();		
					ДобавленыНовыеСтроки = Истина;
				КонецЕсли;
	 		КонецЕсли;
    	КонецЕсли;
 	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СообщениеТекст;
		Сообщение.Сообщить();
	КонецЕсли;
	Возврат ДобавленыНовыеСтроки;
КонецФункции

#КонецОбласти

#КонецЕсли
