
&НаСервере
Процедура ФормироватьНаСервере()
//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
// Данный фрагмент построен конструктором.
// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &АбоненскоеОбслуживание";
	Запрос.УстановитьПараметр("АбоненскоеОбслуживание", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание); 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Выборка.Ссылка;;
		Сообщение.Сообщить();
	КонецЦикла;

//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры

&НаКлиенте
Процедура Формировать(Команда)
	ФормироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодДляУказанияМесяцаПриИзменении(Элемент)
//	потому что не работает формат ДФ='MMММ yyyy' 	
	Месяцы = Новый Массив(12);
    Месяцы[0] = "январь";
    Месяцы[1] = "февраль";
    Месяцы[2] = "март";
    Месяцы[3] = "апрель";
    Месяцы[4] = "май";
    Месяцы[5] = "июнь";
    Месяцы[6] = "июль";
    Месяцы[7] = "август";
    Месяцы[8] = "сентябрь";
    Месяцы[9] = "октябрь";
    Месяцы[10] = "ноябрь";
    Месяцы[11] = "декабрь";
	Элементы.ПериодДляУказанияМесяца.ФорматРедактирования = СтрШаблон("ДФ='''%1'' yyyy'", Месяцы[Месяц(Объект.ПериодДляУказанияМесяца) - 1]);

КонецПроцедуры
