
&НаСервере
Процедура ФормироватьНаСервере()
//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
// Данный фрагмент построен конструктором.
// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК ДоговорСсылка
		|ПОМЕСТИТЬ ВТ_Договор
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &АбонентскоеОбслуживание
		|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора <= &КонецПериода
		|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора >= &НачалоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК РеализацияСсылка,
		|	РеализацияТоваровУслуг.Договор.Ссылка КАК ДоговорСсылка
		|ПОМЕСТИТЬ ВТ_Реализация
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Договор.ВидДоговора = &АбонентскоеОбслуживание
		|	И РеализацияТоваровУслуг.Дата >= &НачалоПериода
		|	И РеализацияТоваровУслуг.Дата <= &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Договор.ДоговорСсылка КАК ДоговорСсылка,
		|	ВТ_Реализация.РеализацияСсылка КАК РеализацияСсылка
		|ИЗ
		|	ВТ_Договор КАК ВТ_Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализация КАК ВТ_Реализация
		|		ПО ВТ_Договор.ДоговорСсылка.Ссылка = ВТ_Реализация.ДоговорСсылка.Ссылка";
	ПериодДляУказанияМесяца = Объект.ПериодДляУказанияМесяца; 
	Запрос.УстановитьПараметр("АбонентскоеОбслуживание", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодДляУказанияМесяца)); 
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодДляУказанияМесяца)); 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("%1     %2", Выборка.ДоговорСсылка, Выборка.РеализацияСсылка);
		Сообщение.Сообщить();
	КонецЦикла;

//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры

&НаКлиенте
Процедура Формировать(Команда)
	ФормироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодДляУказанияМесяцаПриИзменении(Элемент)
//	потому что не работает формат ДФ='MMММ yyyy' 	
	Месяцы = Новый Массив(12);
    Месяцы[0] = "январь";
    Месяцы[1] = "февраль";
    Месяцы[2] = "март";
    Месяцы[3] = "апрель";
    Месяцы[4] = "май";
    Месяцы[5] = "июнь";
    Месяцы[6] = "июль";
    Месяцы[7] = "август";
    Месяцы[8] = "сентябрь";
    Месяцы[9] = "октябрь";
    Месяцы[10] = "ноябрь";
    Месяцы[11] = "декабрь";
	Элементы.ПериодДляУказанияМесяца.ФорматРедактирования = СтрШаблон("ДФ='''%1'' yyyy'", Месяцы[Месяц(Объект.ПериодДляУказанияМесяца) - 1]);

КонецПроцедуры
