
&НаКлиенте
Процедура ПериодДляУказанияМесяцаПриИзменении(Элемент)
//	потому что не работает формат ДФ='MMММ yyyy' 	
	Месяцы = Новый Массив(12);
    Месяцы[0] = "январь";
    Месяцы[1] = "февраль";
    Месяцы[2] = "март";
    Месяцы[3] = "апрель";
    Месяцы[4] = "май";
    Месяцы[5] = "июнь";
    Месяцы[6] = "июль";
    Месяцы[7] = "август";
    Месяцы[8] = "сентябрь";
    Месяцы[9] = "октябрь";
    Месяцы[10] = "ноябрь";
    Месяцы[11] = "декабрь";
	Элементы.ПериодДляУказанияМесяца.ФорматРедактирования = СтрШаблон("ДФ='''%1'' yyyy'", Месяцы[Месяц(Объект.ПериодДляУказанияМесяца) - 1]);

КонецПроцедуры
